[Survived] BlockStatement
src/classes/ConversationAreaController.ts:45:12
   /**
    * The ID of this conversation area (read only)
    */
-  get id() {
-    return this._id;
-  }
+  get id() {}
 
   /**

[Killed] BlockStatement
src/classes/ConversationAreaController.ts:53:51
    * The list of occupants in this conversation area. Changing the set of occupants
    * will emit an occupantsChange event.
    */
-  set occupants(newOccupants: PlayerController[]) {
-    if (
-      newOccupants.length !== this._occupants.length ||
-      _.xor(newOccupants, this._occupants).length > 0
-    ) {
-      this.emit('occupantsChange', newOccupants);
-      this._occupants = newOccupants;
-    }
-  }
+  set occupants(newOccupants: PlayerController[]) {}
 
   get occupants() {
killedBy: [T2] ConversationAreaController isEmpty Returns false if the occupants list is set and the topic is defined
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/classes/ConversationAreaController.ts:55:7
    */
   set occupants(newOccupants: PlayerController[]) {
     if (
-      newOccupants.length !== this._occupants.length ||
-      _.xor(newOccupants, this._occupants).length > 0
+      false
     ) {
       this.emit('occupantsChange', newOccupants);
killedBy: [T2] ConversationAreaController isEmpty Returns false if the occupants list is set and the topic is defined
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/classes/ConversationAreaController.ts:55:7
    */
   set occupants(newOccupants: PlayerController[]) {
     if (
-      newOccupants.length !== this._occupants.length ||
+      newOccupants.length === this._occupants.length ||
       _.xor(newOccupants, this._occupants).length > 0
     ) {
killedBy: [T2] ConversationAreaController setting the occupants property does not update the property if the new occupants are the same set as the old
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

@@ -1,18 +1,18 @@
  Array [
    PlayerController {

[Killed] EqualityOperator
src/classes/ConversationAreaController.ts:56:7
   set occupants(newOccupants: PlayerController[]) {
     if (
       newOccupants.length !== this._occupants.length ||
-      _.xor(newOccupants, this._occupants).length > 0
+      _.xor(newOccupants, this._occupants).length <= 0
     ) {
       this.emit('occupantsChange', newOccupants);
killedBy: [T2] ConversationAreaController setting the occupants property does not update the property if the new occupants are the same set as the old
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

@@ -1,18 +1,18 @@
  Array [
    PlayerController {

[Killed] EqualityOperator
src/classes/ConversationAreaController.ts:56:7
   set occupants(newOccupants: PlayerController[]) {
     if (
       newOccupants.length !== this._occupants.length ||
-      _.xor(newOccupants, this._occupants).length > 0
+      _.xor(newOccupants, this._occupants).length >= 0
     ) {
       this.emit('occupantsChange', newOccupants);
killedBy: [T2] ConversationAreaController setting the occupants property does not update the property if the new occupants are the same set as the old
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

@@ -1,18 +1,18 @@
  Array [
    PlayerController {

[Killed] BlockStatement
src/classes/ConversationAreaController.ts:57:7
     if (
       newOccupants.length !== this._occupants.length ||
       _.xor(newOccupants, this._occupants).length > 0
-    ) {
-      this.emit('occupantsChange', newOccupants);
-      this._occupants = newOccupants;
-    }
+    ) {}
   }
 
killedBy: [T2] ConversationAreaController isEmpty Returns false if the occupants list is set and the topic is defined
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] StringLiteral
src/classes/ConversationAreaController.ts:58:17
       newOccupants.length !== this._occupants.length ||
       _.xor(newOccupants, this._occupants).length > 0
     ) {
-      this.emit('occupantsChange', newOccupants);
+      this.emit("", newOccupants);
       this._occupants = newOccupants;
     }
killedBy: [T2] ConversationAreaController setting the occupants property emits the occupantsChange event when setting the property and updates the model
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)


Number of calls: 0

[Killed] BlockStatement
src/classes/ConversationAreaController.ts:63:19
     }
   }
 
-  get occupants() {
-    return this._occupants;
-  }
+  get occupants() {}
 
   /**
killedBy: [T2] ConversationAreaController setting the occupants property does not update the property if the new occupants are the same set as the old
statusReason: TypeError: Cannot read properties of undefined (reading 'concat')

[Killed] BlockStatement
src/classes/ConversationAreaController.ts:72:43
    *
    * Setting the topic to the value `undefined` will indicate that the conversation area is not active
    */
-  set topic(newTopic: string | undefined) {
-    if (this._topic !== newTopic) {
-      this.emit('topicChange', newTopic);
-    }
-    this._topic = newTopic;
-  }
+  set topic(newTopic: string | undefined) {}
 
   get topic(): string | undefined {
killedBy: [T2] ConversationAreaController isEmpty Returns true if the topic is undefined
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/classes/ConversationAreaController.ts:73:35
    * Setting the topic to the value `undefined` will indicate that the conversation area is not active
    */
   set topic(newTopic: string | undefined) {
-    if (this._topic !== newTopic) {
-      this.emit('topicChange', newTopic);
-    }
+    if (this._topic !== newTopic) {}
     this._topic = newTopic;
   }
killedBy: [T2] ConversationAreaController setting the topic property emits the topicChange event when setting the property and updates the model
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Fb74Zk-TnFxR4B8qGHh1D"

Number of calls: 0

[Killed] EqualityOperator
src/classes/ConversationAreaController.ts:73:9
    * Setting the topic to the value `undefined` will indicate that the conversation area is not active
    */
   set topic(newTopic: string | undefined) {
-    if (this._topic !== newTopic) {
+    if (this._topic === newTopic) {
       this.emit('topicChange', newTopic);
     }
killedBy: [T2] ConversationAreaController setting the topic property does not update the property if the topic is the same string
statusReason: Error: expect(jest.fn()).not.toBeCalled()

Expected number of calls: 0
Received number of calls: 1

1: "iJpnHvIlIaVNqlLewA5oT"

[Killed] StringLiteral
src/classes/ConversationAreaController.ts:74:17
    */
   set topic(newTopic: string | undefined) {
     if (this._topic !== newTopic) {
-      this.emit('topicChange', newTopic);
+      this.emit("", newTopic);
     }
     this._topic = newTopic;
killedBy: [T2] ConversationAreaController setting the topic property emits the topicChange event when setting the property and updates the model
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "-mPDfSrNq-pYRkM17sAJw"

Number of calls: 0

[Killed] BlockStatement
src/classes/ConversationAreaController.ts:79:35
     this._topic = newTopic;
   }
 
-  get topic(): string | undefined {
-    return this._topic;
-  }
+  get topic(): string | undefined {}
 
   /**
killedBy: [T2] ConversationAreaController setting the topic property does not update the property if the topic is the same string
statusReason: Error: expect(jest.fn()).not.toBeCalled()

Expected number of calls: 0
Received number of calls: 1

1: "undefined"

[Killed] BlockStatement
src/classes/ConversationAreaController.ts:86:22
   /**
    * A conversation area is empty if there are no occupants in it, or the topic is undefined.
    */
-  isEmpty(): boolean {
-    return this._topic === undefined || this._occupants.length === 0;
-  }
+  isEmpty(): boolean {}
 
   /**
killedBy: [T2] ConversationAreaController isEmpty Returns true if the occupants list is empty
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
src/classes/ConversationAreaController.ts:87:41
    * A conversation area is empty if there are no occupants in it, or the topic is undefined.
    */
   isEmpty(): boolean {
-    return this._topic === undefined || this._occupants.length === 0;
+    return this._topic === undefined || false;
   }
 
killedBy: [T2] ConversationAreaController isEmpty Returns true if the occupants list is empty
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/classes/ConversationAreaController.ts:87:12
    * A conversation area is empty if there are no occupants in it, or the topic is undefined.
    */
   isEmpty(): boolean {
-    return this._topic === undefined || this._occupants.length === 0;
+    return false || this._occupants.length === 0;
   }
 
killedBy: [T2] ConversationAreaController isEmpty Returns true if the topic is undefined
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/classes/ConversationAreaController.ts:94:52
    * Return a representation of this ConversationAreaController that matches the
    * townService's representation and is suitable for transmitting over the network.
    */
-  toConversationAreaModel(): ConversationAreaModel {
-    return {
-      id: this.id,
-      occupantsByID: this.occupants.map(player => player.id),
-      topic: this.topic,
-    };
-  }
+  toConversationAreaModel(): ConversationAreaModel {}
 
   /**
killedBy: [T2] ConversationAreaController setting the occupants property emits the occupantsChange event when setting the property and updates the model
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"id": "xuyu1WbfB5YqUXi17yO9f", "occupantsByID": ["b1xj2PuXDwqIZZqMZxDg5", "Wqph6eu_HC4wECzfyq4LR"], "topic": "1weVP98prabxx9CfK6ImO"}
Received: undefined

[Killed] ArrowFunction
src/classes/ConversationAreaController.ts:97:41
   toConversationAreaModel(): ConversationAreaModel {
     return {
       id: this.id,
-      occupantsByID: this.occupants.map(player => player.id),
+      occupantsByID: this.occupants.map(() => undefined),
       topic: this.topic,
     };
killedBy: [T2] ConversationAreaController setting the occupants property emits the occupantsChange event when setting the property and updates the model
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
    "id": "fGbRTsxtGJ6CafKfYAyAe",
    "occupantsByID": Array [

[Survived] BlockStatement
src/classes/ConversationAreaController.ts:111:33
   static fromConversationAreaModel(
     convAreaModel: ConversationAreaModel,
     playerFinder: (playerIDs: string[]) => PlayerController[],
-  ): ConversationAreaController {
-    const ret = new ConversationAreaController(convAreaModel.id, convAreaModel.topic);
-    ret.occupants = playerFinder(convAreaModel.occupantsByID);
-    return ret;
-  }
+  ): ConversationAreaController {}
 }
 

[Survived] BlockStatement
src/classes/ConversationAreaController.ts:123:100
  *
  * This hook will re-render any components that use it when the set of occupants changes.
  */
-export function useConversationAreaOccupants(area: ConversationAreaController): PlayerController[] {
-  const [occupants, setOccupants] = useState(area.occupants);
-  useEffect(() => {
-    area.addListener('occupantsChange', setOccupants);
-    return () => {
-      area.removeListener('occupantsChange', setOccupants);
-    };
-  }, [area]);
-  return occupants;
-}
+export function useConversationAreaOccupants(area: ConversationAreaController): PlayerController[] {}
 
 /**

[Survived] BlockStatement
src/classes/ConversationAreaController.ts:125:19
  */
 export function useConversationAreaOccupants(area: ConversationAreaController): PlayerController[] {
   const [occupants, setOccupants] = useState(area.occupants);
-  useEffect(() => {
-    area.addListener('occupantsChange', setOccupants);
-    return () => {
-      area.removeListener('occupantsChange', setOccupants);
-    };
-  }, [area]);
+  useEffect(() => {}, [area]);
   return occupants;
 }

[Survived] BlockStatement
src/classes/ConversationAreaController.ts:127:18
   const [occupants, setOccupants] = useState(area.occupants);
   useEffect(() => {
     area.addListener('occupantsChange', setOccupants);
-    return () => {
-      area.removeListener('occupantsChange', setOccupants);
-    };
+    return () => {};
   }, [area]);
   return occupants;

[Survived] BlockStatement
src/classes/ConversationAreaController.ts:140:84
  *
  * This hook will re-render any components that use it when the topic changes.
  */
-export function useConversationAreaTopic(area: ConversationAreaController): string {
-  const [topic, setTopic] = useState(area.topic);
-  useEffect(() => {
-    area.addListener('topicChange', setTopic);
-    return () => {
-      area.removeListener('topicChange', setTopic);
-    };
-  }, [area]);
-  return topic || NO_TOPIC_STRING;
-}
+export function useConversationAreaTopic(area: ConversationAreaController): string {}
 

[Survived] BlockStatement
src/classes/ConversationAreaController.ts:142:19
  */
 export function useConversationAreaTopic(area: ConversationAreaController): string {
   const [topic, setTopic] = useState(area.topic);
-  useEffect(() => {
-    area.addListener('topicChange', setTopic);
-    return () => {
-      area.removeListener('topicChange', setTopic);
-    };
-  }, [area]);
+  useEffect(() => {}, [area]);
   return topic || NO_TOPIC_STRING;
 }

[Survived] StringLiteral
src/classes/ConversationAreaController.ts:143:22
 export function useConversationAreaTopic(area: ConversationAreaController): string {
   const [topic, setTopic] = useState(area.topic);
   useEffect(() => {
-    area.addListener('topicChange', setTopic);
+    area.addListener("", setTopic);
     return () => {
       area.removeListener('topicChange', setTopic);

[Survived] BlockStatement
src/classes/ConversationAreaController.ts:144:18
   const [topic, setTopic] = useState(area.topic);
   useEffect(() => {
     area.addListener('topicChange', setTopic);
-    return () => {
-      area.removeListener('topicChange', setTopic);
-    };
+    return () => {};
   }, [area]);
   return topic || NO_TOPIC_STRING;

[Survived] ConditionalExpression
src/classes/ConversationAreaController.ts:148:10
       area.removeListener('topicChange', setTopic);
     };
   }, [area]);
-  return topic || NO_TOPIC_STRING;
+  return false;
 }
 

[Survived] ConditionalExpression
src/classes/ConversationAreaController.ts:148:10
       area.removeListener('topicChange', setTopic);
     };
   }, [area]);
-  return topic || NO_TOPIC_STRING;
+  return true;
 }
 
