[Killed] BlockStatement
src/classes/ViewingAreaController.ts:45:51
    *
    * @param viewingAreaModel The viewing area model that this controller should represent
    */
-  constructor(viewingAreaModel: ViewingAreaModel) {
-    super();
-    this._model = viewingAreaModel;
-  }
+  constructor(viewingAreaModel: ViewingAreaModel) {}
 
   /**
killedBy: [T2] ViewingAreaController Setting video property updates the property and emits a videoChange event if the property changes
statusReason: ReferenceError: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Survived] BlockStatement
src/classes/ViewingAreaController.ts:55:19
    * This property is read-only: once a ViewingAreaController is created, it will always be
    * tied to the same viewing area ID.
    */
-  public get id() {
-    return this._model.id;
-  }
+  public get id() {}
 
   /**

[Killed] BlockStatement
src/classes/ViewingAreaController.ts:62:22
   /**
    * The URL of the video assigned to this viewing area, or undefined if there is not one.
    */
-  public get video() {
-    return this._model.video;
-  }
+  public get video() {}
 
   /**
killedBy: [T2] ViewingAreaController Setting video property updates the property and emits a videoChange event if the property changes
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "KAhmDZ1yDhlVy8SB6I3aO"
Received: undefined

[Killed] BlockStatement
src/classes/ViewingAreaController.ts:71:47
    *
    * Changing this value will emit a 'videoChange' event to listeners
    */
-  public set video(video: string | undefined) {
-    if (this._model.video !== video) {
-      this.emit('videoChange', video);
-    }
-    this._model.video = video;
-  }
+  public set video(video: string | undefined) {}
 
   /**
killedBy: [T2] ViewingAreaController Setting video property updates the property and emits a videoChange event if the property changes
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "BBwN1kULQzOqINumTC71P"

Number of calls: 0

[Killed] EqualityOperator
src/classes/ViewingAreaController.ts:72:9
    * Changing this value will emit a 'videoChange' event to listeners
    */
   public set video(video: string | undefined) {
-    if (this._model.video !== video) {
+    if (this._model.video === video) {
       this.emit('videoChange', video);
     }
killedBy: [T2] ViewingAreaController Setting video property updates the property and emits a videoChange event if the property changes
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "6ggq5LP6FSr38AAANLK6L"

Number of calls: 0

[Killed] ConditionalExpression
src/classes/ViewingAreaController.ts:72:9
    * Changing this value will emit a 'videoChange' event to listeners
    */
   public set video(video: string | undefined) {
-    if (this._model.video !== video) {
+    if (true) {
       this.emit('videoChange', video);
     }
killedBy: [T2] ViewingAreaController Setting video property does not emit a videoChange event if the video property does not change
statusReason: Error: expect(jest.fn()).not.toBeCalled()

Expected number of calls: 0
Received number of calls: 1

1: "sjJtaBKzHa0OGlHAtq63d"

[Killed] BlockStatement
src/classes/ViewingAreaController.ts:81:31
   /**
    * The playback position of the video, in seconds (a floating point number)
    */
-  public get elapsedTimeSec() {
-    return this._model.elapsedTimeSec;
-  }
+  public get elapsedTimeSec() {}
 
   /**
killedBy: [T2] ViewingAreaController Setting elapsedTimeSec property updates the model and emits a progressChange event if the property changes
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: NaN
Received: undefined

[Killed] BlockStatement
src/classes/ViewingAreaController.ts:90:53
    *
    * Changing this value will emit a 'progressChange' event to listeners
    */
-  public set elapsedTimeSec(elapsedTimeSec: number) {
-    if (this._model.elapsedTimeSec != elapsedTimeSec) {
-      this.emit('progressChange', elapsedTimeSec);
-      this._model.elapsedTimeSec = elapsedTimeSec;
-    }
-  }
+  public set elapsedTimeSec(elapsedTimeSec: number) {}
 
   /**
killedBy: [T2] ViewingAreaController Setting elapsedTimeSec property updates the model and emits a progressChange event if the property changes
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: 13

Number of calls: 0

[Killed] ConditionalExpression
src/classes/ViewingAreaController.ts:91:9
    * Changing this value will emit a 'progressChange' event to listeners
    */
   public set elapsedTimeSec(elapsedTimeSec: number) {
-    if (this._model.elapsedTimeSec != elapsedTimeSec) {
+    if (true) {
       this.emit('progressChange', elapsedTimeSec);
       this._model.elapsedTimeSec = elapsedTimeSec;
killedBy: [T2] ViewingAreaController Setting elapsedTimeSec property does not emit a progressChange event if the elapsedTimeSec property does not change
statusReason: Error: expect(jest.fn()).not.toBeCalled()

Expected number of calls: 0
Received number of calls: 1

1: 12

[Killed] EqualityOperator
src/classes/ViewingAreaController.ts:91:9
    * Changing this value will emit a 'progressChange' event to listeners
    */
   public set elapsedTimeSec(elapsedTimeSec: number) {
-    if (this._model.elapsedTimeSec != elapsedTimeSec) {
+    if (this._model.elapsedTimeSec == elapsedTimeSec) {
       this.emit('progressChange', elapsedTimeSec);
       this._model.elapsedTimeSec = elapsedTimeSec;
killedBy: [T2] ViewingAreaController Setting elapsedTimeSec property updates the model and emits a progressChange event if the property changes
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: 13

Number of calls: 0

[Killed] StringLiteral
src/classes/ViewingAreaController.ts:92:17
    */
   public set elapsedTimeSec(elapsedTimeSec: number) {
     if (this._model.elapsedTimeSec != elapsedTimeSec) {
-      this.emit('progressChange', elapsedTimeSec);
+      this.emit("", elapsedTimeSec);
       this._model.elapsedTimeSec = elapsedTimeSec;
     }
killedBy: [T2] ViewingAreaController Setting elapsedTimeSec property updates the model and emits a progressChange event if the property changes
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: 13

Number of calls: 0

[Killed] BlockStatement
src/classes/ViewingAreaController.ts:101:26
    * The playback state - true indicating that the video is playing, false indicating
    * that the video is paused.
    */
-  public get isPlaying() {
-    return this._model.isPlaying;
-  }
+  public get isPlaying() {}
 
   /**
killedBy: [T2] ViewingAreaController Setting isPlaying property updates the model and emits a playbackChange event if the property changes
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: undefined

[Killed] BlockStatement
src/classes/ViewingAreaController.ts:111:44
    *
    * Changing this value will emit a 'playbackChange' event to listeners
    */
-  public set isPlaying(isPlaying: boolean) {
-    if (this._model.isPlaying != isPlaying) {
-      this.emit('playbackChange', isPlaying);
-      this._model.isPlaying = isPlaying;
-    }
-  }
+  public set isPlaying(isPlaying: boolean) {}
 
   /**
killedBy: [T2] ViewingAreaController Setting isPlaying property updates the model and emits a playbackChange event if the property changes
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: false

Number of calls: 0

[Killed] ConditionalExpression
src/classes/ViewingAreaController.ts:112:9
    * Changing this value will emit a 'playbackChange' event to listeners
    */
   public set isPlaying(isPlaying: boolean) {
-    if (this._model.isPlaying != isPlaying) {
+    if (true) {
       this.emit('playbackChange', isPlaying);
       this._model.isPlaying = isPlaying;
killedBy: [T2] ViewingAreaController Setting isPlaying property does not emit a playbackChange event if the isPlaying property does not change
statusReason: Error: expect(jest.fn()).not.toBeCalled()

Expected number of calls: 0
Received number of calls: 1

1: true

[Killed] BlockStatement
src/classes/ViewingAreaController.ts:112:45
    * Changing this value will emit a 'playbackChange' event to listeners
    */
   public set isPlaying(isPlaying: boolean) {
-    if (this._model.isPlaying != isPlaying) {
-      this.emit('playbackChange', isPlaying);
-      this._model.isPlaying = isPlaying;
-    }
+    if (this._model.isPlaying != isPlaying) {}
   }
 
killedBy: [T2] ViewingAreaController Setting isPlaying property updates the model and emits a playbackChange event if the property changes
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: false

Number of calls: 0

[Survived] BlockStatement
src/classes/ViewingAreaController.ts:121:47
   /**
    * @returns ViewingAreaModel that represents the current state of this ViewingAreaController
    */
-  public viewingAreaModel(): ViewingAreaModel {
-    return this._model;
-  }
+  public viewingAreaModel(): ViewingAreaModel {}
 
   /**

[Killed] BlockStatement
src/classes/ViewingAreaController.ts:131:59
    *
    * @param updatedModel
    */
-  public updateFrom(updatedModel: ViewingAreaModel): void {
-    this.isPlaying = updatedModel.isPlaying;
-    this.elapsedTimeSec = updatedModel.elapsedTimeSec;
-    this.video = updatedModel.video;
-  }
+  public updateFrom(updatedModel: ViewingAreaModel): void {}
 }
 
killedBy: [T2] ViewingAreaController updateFrom Updates the isPlaying, elapsedTimeSec and video properties
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "G_MXvodOXapoDsyXNGgdZ"
Received: "7YlaPRvm1wwIxJrBVyWJt"
